# Assignment #9 - Data Gathering and Warehousing - DSSA-5102

Instructor: Melissa Laurino</br>
Spring 2025</br>

Name: Jordan Davis 
</br>
Date: 4/24/25
<br>
<br>
**At this time in the semester:** <br>
- We have explored a dataset. <br>
- We have cleaned our dataset. <br>
- We created a Github account with a repository for this class and included a metadata read me file about our data. <br>
- We introduced general SQL syntax, queries, and applications in Python.<br>
- Created our own databases from scratch using MySQL Workbench and Python with SQLAlchemy on our local server and locally on our machine.
- Populated our databases with the data we cleaned at the start of the semester.
<br>

At this point, we have discussed all major statements used with SQL, but the possibilities are endless when it comes to data! Below we will explore some miscellaneous statements and tools that may be useful with your database.<br>

<br>

Read Chapter 7 & 10 in Getting Started with SQL by Thomas Nield available on Blackboard. <br>
A quick reference for SQL commands: https://www.w3schools.com/sql/default.asp <br>

Review the powerpoint and other readings specified on Blackboard in the Discussion Board.<br>

In the event your database does not meet the requirements below to answer the question, please use the database provided in Assignment #4 and #5. Remember to credit your data source, especially when posting your assignments to Github.<br>

Feel free to use your preferred library and method for the exploration below. Now that all of our data is loaded onto the MySQL Workbench server, you can even take the assignment a step further and complete it all within SQL without Jupyter Notebook!<br>

Follow the instructions below to complete the assignment. Be sure to comment **all** code and answer **all** questions in markdown for full credit. Please submit this assignment with a link to it posted to your Github.<br>

**Data origin:** This fabulous database was created by @NUKnightLab on Github and can be found here: https://github.com/NUKnightLab/sql-mysteries

In [17]:
# Load necessary packages:
from sqlalchemy import create_engine, Column, String, Integer, Boolean, BigInteger, Float, text # Database navigation
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker
from sqlalchemy import inspect # Helps with seeing the structure of the database
import mysql.connector
import sqlite3 # A second option for working with databases
import pandas as pd # Python data manilpulation
import numpy as np # Populating our tables

In [3]:
# Connect to the MySQL server 
# Define our variables. We set these during our first class in our technology set up. 
# If you are unsure of these variables, do not guess. 
# Visit MySQL Workbench for the localport number, host and user.

#conn = mysql.connector.connect(
#        host="localhost", # This is your local instance number when you open MySQL Workbench.
#        user="root", # This is your username for MySQL Workbench
#        password="Jordansade4!") # We wrote this password down in our first class!

# In order to connect to the server, we must include all of the above.

#cursor = conn.cursor()

# CREATE DATABASE (SQL command) if it does not already exist
# cursor.execute("CREATE DATABASE IF NOT EXISTS MySQL_SpotifyDatabase")
# MySQL_SpotifyDatabase will be the name when the database is created.

#print("Database created successfully in MySQL Workbench! Go check it out.")

# Since my database is created now, I USE The database instead.
#cursor.execute("USE MySQL_SpotifyDatabase")
#print("Using the MySQL_SpotifyDatabase!")

In [5]:
# Time to connect to the database using SQL Alchemy by creating an engine:
#DATABASE_URL = "mysql+mysqlconnector://root:TippyTt0006!@localhost/MySQL_SpotifyDatabase" # Use MySQL Connector to connect to the database
#engine = create_engine(DATABASE_URL) # Creates a connection to the MySQL database

#print("Connected to MySQL database successfully!")

My database doesn't meet the requirements so I am going to use the SQL City database from projects 4-5, I credited the source above.

In [11]:
# Creating the path to the database 
db_path = r"C:\Users\jorda\Documents\Data_Gathering\Assignmet9\sql-murder-mystery.db"

# Creating the engine
engine = create_engine(f"sqlite:///{db_path}")

# Testing the connection
with engine.connect() as conn:
# Printing a statement to make sure it worked
    print("Connected to SQLite database successfully!")

Connected to SQLite database successfully!

In [19]:
# Write a query to list the table names of the database:
# Creating an inspector object to get the names
inspector = inspect(engine)

# Getting and printing all table names
tables = inspector.get_table_names()
print("Tables in the database:", tables)

Tables in the database: ['crime_scene_report', 'drivers_license', 'facebook_event_checkin', 'get_fit_now_check_in', 'get_fit_now_member', 'income', 'interview', 'person', 'solution']

#### CASE Statements
Case statements are similar to the if-then-else statements in programming. The data that meets the case statements in the database will be returned. You start a CASE statement with the word CASE and conclude it with an END. Between those keywords, you specify each condition with a WHEN [condition] THEN [value], where the condition and the values are specified by you.

Nield, Thomas. Getting Started with SQL (p. 71). O'Reilly Media. Kindle Edition. <br>
<br>
Write your question you are answering with your data query. <br>
<br>
Can I group people based on whether they live on a street with "St", "Way", or something else?
<br>
**What tables are we joining? (If any):** I'm not joining any tables for this query

In [34]:
# Starting the query
query = """
SELECT 
    name,                            -- Person's name
    address_street_name,            -- Their street name
    CASE 
        WHEN address_street_name LIKE '%Way' THEN 'Way'      -- Match containing Way
        WHEN address_street_name LIKE '%St' THEN 'St'    -- Match containing Street
        ELSE 'Other'                                                     -- Everything else
    END AS location_group
FROM person;
"""

# Executes the query and loads the results into a data frame
df = pd.read_sql_query(query, engine)

# Displays the first few rows
df.head()

                  name address_street_name location_group
0   Christoper Peteuil        Bankhall Ave          Other
1  Kourtney Calderwood       Gustavus Blvd          Other
2            Muoi Cary     Northwestern Dr          Other
3          Era Moselle       Wood Glade St             St
4         Trena Hornby       Daws Hill Way            Way

**CASE STATEMENT**
<br>
Write a second CASE statement!

Write your question you are answering with your data query. <br>
<br>
**Question:** Can I detect people who are under 21 and flag them as being underaged for drinking?
<br>
**What tables are we joining? (If any):** I am not joining any tables for this query

In [40]:
# Starting the query 
query2 = """
SELECT 
    id,                             -- Unique ID from the drivers_license table
    age,                            -- Person's age
    CASE
        WHEN age < 21 THEN 'Underage'       -- If under 21, flags as Underage
        ELSE '21 or older'                  -- Otherwise, flag as 21 or older
    END AS drinking_status                 -- Name of the new categorized column
FROM drivers_license;                      -- Source table
"""

# Runs the query and loads the results into a data frame
df2 = pd.read_sql_query(query2, engine)

# Shows the first few rows of the results
df2.head()

       id  age drinking_status
0  100280   72     21 or older
1  100460   63     21 or older
2  101029   62     21 or older
3  101198   43     21 or older
4  101255   18        Underage

**CASE STATEMENT**
<br>
Write a third CASE statement!

Write your question you are answering with your data query. <br>
<br>
**Question:** If the suspects height is between 65 and 72 inches, can I query to flag peoples' ids for the range of heights?
<br>
**What tables are we joining? (If any):** I a not joining any tables

In [44]:
# Starting the query 
query3 = """
SELECT 
    id,                              -- Unique identifier for the person
    height,                          -- Recorded height in inches
    CASE
        WHEN height < 65 THEN 'Below Range'          -- Shorter than suspect description
        WHEN height BETWEEN 65 AND 72 THEN 'Suspect Height'  -- Within suspect range
        ELSE 'Above Range'                          -- Taller than expected
    END AS height_flag
FROM drivers_license;
"""

# Runs the query and stores the result in a data frame
df3 = pd.read_sql_query(query3, engine)

# Shows the first few records
df3.head()

       id  height     height_flag
0  100280      57     Below Range
1  100460      72  Suspect Height
2  101029      74     Above Range
3  101198      54     Below Range
4  101255      79     Above Range

**NULL**
<br>
As with all data, NULL values are fields with no data. Null data can be useful to know with the INSERT INTO statement below.

Find the NULL data within your database. Write your question you are answering with your data query. <br>
<br>
**Question:** Is there any Null data?
<br>

In [48]:
# Starting the query with count statements 
query_null_counts = """
SELECT 
    COUNT(*) AS total_rows,  -- Total number of rows in the table
    SUM(CASE WHEN height IS NULL THEN 1 ELSE 0 END) AS null_height,  -- Counts of NULLs in height column
    SUM(CASE WHEN eye_color IS NULL THEN 1 ELSE 0 END) AS null_eye_color  -- Counts of NULLs in eye_color column
FROM drivers_license;
"""

# Executes the query and load the result into a data frame
df_null_counts = pd.read_sql_query(query_null_counts, engine)

# Displays the results
df_null_counts

   total_rows  null_height  null_eye_color
0       10007            0               0

It seems that there are no Null values in these columns.

**INSERT INTO**
<br>
You can insert new records into a table as needed using the INSERT INTO statement. If you choose to populate a table with certain records and not others, the rest of the fields will remain empty/NULL.
<br>
For INSERT INTO, we are not querying the database, instead we are ADDING to it. We do not need to use dbGetQuery(), but instead, dbExecute()!
<br><br>
**Objective:** I am putting a new person into the table 
<br>
**What table(s) are we adding a record to?** The drivers license table

In [50]:
# Defining the statement 
insert_query = text("""
INSERT INTO drivers_license 
    (id, age, height, eye_color, hair_color, gender, plate_number, car_make, car_model)
VALUES 
    (999999,          -- Unique ID for the license record
     32,              -- Age of the person
     70,              -- Height in inches
     'Brown',         -- Eye color
     'Black',         -- Hair color
     'F',             -- Gender
     'L999999',       -- License plate number
     'Toyota',        -- Car make
     'Camry');        -- Car model
""")

# Connects to the database and executes the insert
with engine.connect() as conn:
    conn.execute(insert_query)  # Executes the insert command
    conn.commit()               # Saves the change to the database

# Making sure it worked
print("New license record inserted.")

New license record inserted.

**MIN() and MAX()**
<br>
You can use these statements alone or in combination with the CASE statemts above.<br>
The IN operator in a WHERE clause lets you filter for multiple values at once. You can also exclude certain values by using the NOT IN operator.
<br>

**Question:** What are the youngest and oldest ages in the drivers license tables?
<br>
**What table(s) are we joining? (If any)** I am not joining any tables

In [58]:
# This query checks each driver's age and flags whether they are the youngest, oldest, or in the average range
# using a CASE statement along with MIN() and MAX().

query_age_extremes = """
SELECT 
    id,             -- ID of the driver
    age,            -- Age of the driver
    CASE
        WHEN age = (SELECT MIN(age) FROM drivers_license) THEN 'Youngest'
        WHEN age = (SELECT MAX(age) FROM drivers_license) THEN 'Oldest'
        ELSE 'Average Range'
    END AS age_category
FROM drivers_license;
"""

# Runs the query and display results
df_age_extremes = pd.read_sql_query(query_age_extremes, engine)
df_age_extremes.head()

       id  age   age_category
0  100280   72  Average Range
1  100460   63  Average Range
2  101029   62  Average Range
3  101198   43  Average Range
4  101255   18       Youngest

This doesn't show the oldest, but it still shows how it flagged some of them.

**MIN() and MAX()** <br>
AVG() will take the average of a numeric field.

**Question:** What is the average height of people in the drivers_license table, and how does each individual compare to it?
<br>

In [60]:
# This query compares each driver's height to the overall average height.
# It flags them as Below Avg, Above Avg, or At Avg using a CASE statement.

query_avg_height = """
SELECT 
    id,
    height,
    CASE
        WHEN height < (SELECT AVG(height) FROM drivers_license) THEN 'Below Avg'
        WHEN height > (SELECT AVG(height) FROM drivers_license) THEN 'Above Avg'
        ELSE 'At Avg'
    END AS height_vs_avg
FROM drivers_license
WHERE height IS NOT NULL;
"""

# Runs the query and loads into a data frame
df_avg_height = pd.read_sql_query(query_avg_height, engine)

# Shows the results
df_avg_height.head()

       id  height height_vs_avg
0  100280      57     Below Avg
1  100460      72     Above Avg
2  101029      74     Above Avg
3  101198      54     Below Avg
4  101255      79     Above Avg

Although this query gives us a quick answer, as a stand alone data frame, it is not that useful. We can add it to our longer query above. <br><br>
**Aliases (AS)**
<br>
You can abbreviate your code to make it more visually appealing...or more confusing? :) <br>
<br>
Examples:<br>
FROM table_name t<br>
FROM table_name AS t<br>
<br>
**Objective:** Use abbreviations or aliases for all tables for the same code you wrote above (If you have not done so already). Be sure to obtain the same result set.

In [62]:
# This version of the AVG height query uses an alias "dl" for the drivers_license table.
# Starting the query
query_avg_height_alias = """
SELECT 
    dl.id,                             -- The ID of the driver (from the alias dl)
    dl.height,                         -- The driver's height
    CASE
        WHEN dl.height < (SELECT AVG(height) FROM drivers_license) THEN 'Below Avg'  -- Less than average
        WHEN dl.height > (SELECT AVG(height) FROM drivers_license) THEN 'Above Avg'  -- Greater than average
        ELSE 'At Avg'                                                       -- Equal to the average
    END AS height_vs_avg               -- New column showing how height compares to the average
FROM drivers_license AS dl            -- Using alias dl for drivers_license
WHERE dl.height IS NOT NULL;          -- Excludes rows where height is missing
"""

# Runs the query and loads into a data frame 
df_avg_height_alias = pd.read_sql_query(query_avg_height_alias, engine)

# Displays the results
df_avg_height_alias.head()

       id  height height_vs_avg
0  100280      57     Below Avg
1  100460      72     Above Avg
2  101029      74     Above Avg
3  101198      54     Below Avg
4  101255      79     Above Avg

Now we are starting to create multiple new fields that we can save any time as a .csv if needed to access later. Save your result set as a .csv:

In [64]:
# Save result set as .csv file:
df_avg_height_alias.to_csv("avg_height_analysis.csv", index=False)

**DELETE** ~Caution!~
<br>
You can delete all records from specific tables or set a criteria to delete certain values or NULL values without deleting the table itself. It is okay if you do not execute the code if you have completed all data cleaning steps earlier in the semester.<br>
<br>
If you created autoincrement IDs for any of your data, it is recommended to use TRUNCATE TABLE instead, used the same way. The ID's will automatically reset if needed.<br>
<br>
**Objective:** Delete all data from before 2013 in the listening history table, since the year 2012 is incomplete.
<br>
**What table(s) are we deleting records from?** song

In [68]:
# I do not want to actually delete this, so I am not going to execute it :)

In [66]:
# This DELETE query would remove any records from the drivers_license table
# where the license plate number starts with the letter Z

# delete_query = text("""
# DELETE FROM drivers_license
# WHERE plate_number LIKE 'Z%';
# """)

# Connecting to the engine
# with engine.connect() as conn:
#     conn.execute(delete_query)
#     conn.commit()
# Printing to make sure it deleted
# print("Deleted drivers with plate numbers starting with Z")

We can also delete entire tables in MySQL workbench by manually right clicking on the table and DROP TABLE. <br>
MySQL Workbench will prompt you to review the SQL syntax before dropping the table.<br>
The syntax is simple:<br>
DROP TABLE table_name<br>

In [74]:
#Close the database connection :)
conn.close()

**STOP**<br>
Before you submit, did you comment all your code?<br>
Did you answer all of the questions in the markdown cells?<br>
Did you rename the file and write your name at the top of the .pynb?<br>
Attach the .csv file you created with your Blackboard submission. It is preferred that you submit your Github link instead of the file itself.